OpenNuvoton/M55M1BSP/Library/UsbHostLib/src_uac/uac_driver.c
/**************************************************************************//**
 * @file     uac_driver.c
 * @version  V1.00
 * @brief    USB Host library audio class driver.
 *           Support mono and stereo audio input and output.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <string.h>

#include "NuMicro.h"

#include "usb.h"
#include "usbh_lib.h"
#include "usbh_uac.h"
#include "uac.h"

/** @addtogroup LIBRARY Library
  @{
*/

/** @addtogroup USBH_Library USBH Library
  @{
*/

/** @addtogroup USBH_EXPORTED_FUNCTIONS USBH Exported Functions
  @{
*/

/// @cond HIDDEN_SYMBOLS

static UAC_DEV_T   g_uac_dev[CONFIG_UAC_MAX_DEV];

static UAC_DEV_T   *g_uac_list = USBNULL;

static UAC_DEV_T *alloc_uac_device(void)
{
    int     i;

    for (i = 0; i < CONFIG_UAC_MAX_DEV; i++)
    {
        if (g_uac_dev[i].udev == USBNULL)
        {
            (void)memset((char *)&g_uac_dev[i], 0, sizeof(UAC_DEV_T));
            return &g_uac_dev[i];
        }
    }

    return USBNULL;
}

static void  free_uac_device(UAC_DEV_T *uac)
{
    uac->udev = USBNULL;
}

static UAC_DEV_T *find_uac_device(const UDEV_T *udev)
{
    int     i;

    if (udev == USBNULL)
    {
        return USBNULL;
    }

    for (i = 0; i < CONFIG_UAC_MAX_DEV; i++)
    {
        if (g_uac_dev[i].udev == udev)
        {
            return &g_uac_dev[i];
        }
    }

    return USBNULL;
}

static int  uac_probe(IFACE_T *iface)
{
    UDEV_T       *udev = iface->udev;
    ALT_IFACE_T  *aif = iface->aif;
    DESC_IF_T    *ifd;
    UAC_DEV_T    *uac;
    UAC_DEV_T    *p;
    uint8_t      bAlternateSetting;
    int          ret = 0;

    ifd = aif->ifd;

    /* Is this interface Audio class? */
    if (ifd->bInterfaceClass != USB_CLASS_AUDIO)
    {
        return USBH_ERR_NOT_MATCHED;
    }

    if ((ifd->bInterfaceSubClass != SUBCLS_AUDIOCONTROL) &&
            (ifd->bInterfaceSubClass != SUBCLS_AUDIOSTREAMING))
    {
        UAC_ERRMSG("Audio class interface, but sub-class %x not supported!\n", ifd->bInterfaceSubClass);
        return USBH_ERR_NOT_MATCHED;
    }

    UAC_DBGMSG("\nuac_probe - device (vid=0x%x, pid=0x%x), interface %d, type: %s\n",
               udev->descriptor.idVendor, udev->descriptor.idProduct, iface->if_num, (ifd->bInterfaceSubClass == SUBCLS_AUDIOCONTROL) ? "CONTROL" : "STREAM");

    uac = find_uac_device(udev);

    if (uac == USBNULL)
    {
        /* UAC device should has not been created in the previous probe of the other interface    */
        /* return 0 to make USB core adding this interface to device working interface list.  */
        uac = alloc_uac_device();

        if (uac == USBNULL)
        {
            return UAC_RET_OUT_OF_MEMORY;
        }

        uac->udev = udev;
        uac->state = UAC_STATE_CONNECTING;

        /*  Add newly found Audio Class device to end of Audio Class device list.
        */
        if (g_uac_list == USBNULL)
        {
            g_uac_list = uac;
        }
        else
        {
            for (p = g_uac_list; p->next != USBNULL; p = p->next)
            {
                ;
            }

            p->next = uac;
        }
    }

    iface->context = (void *)uac;

    /*------------------------------------------------------------------------------------*/
    /*  Detect UAC version from bInterfaceProtocol (early detection for probe ordering)   */
    /*------------------------------------------------------------------------------------*/
    if (uac->acif.bcdADC == 0U)
    {
        if (ifd->bInterfaceProtocol == PR_PROTOCOL_IP_VERSION_02_00)
        {
            uac->acif.bcdADC = UAC_VERSION_2;
            UAC_DBGMSG("UAC 2.0 device detected (protocol=0x%02x)\n", ifd->bInterfaceProtocol);
        }
    }

    if (ifd->bInterfaceSubClass == SUBCLS_AUDIOSTREAMING)
    {
        if ((usbh_uac_find_max_alt(iface, EP_ADDR_DIR_IN, EP_ATTR_TT_ISO, &bAlternateSetting) == 0) ||
                (usbh_uac_find_max_alt(iface, EP_ADDR_DIR_OUT, EP_ATTR_TT_ISO, &bAlternateSetting) == 0))
        {
            ret = usbh_set_interface(iface, bAlternateSetting);

            if (ret < 0)
            {
                UAC_ERRMSG("Failed to set interface %d, %d! (%d)\n", iface->if_num, bAlternateSetting, ret);
                return UAC_RET_IO_ERR;
            }
        }
        else
        {
            UAC_ERRMSG("Cannot find audio stream endpoints!\n");
            return UAC_RET_DEV_NOT_FOUND;
        }

        ret = uac_parse_streaming_interface(uac, iface, bAlternateSetting);

        if (ret < 0)
        {
            return ret;
        }
    }
    else if (ifd->bInterfaceSubClass == SUBCLS_AUDIOCONTROL)
    {
        ret = uac_parse_control_interface(uac, iface);

        if (ret < 0)
        {
            return ret;
        }
    }
    else
    {
        // Unrecognized audio interface subclass. This should not happen as we have checked it before.
    }

    UAC_DBGMSG("UAC device 0x%x (bcdADC=0x%04x) ==>\n", (int)uac, uac->acif.bcdADC);
    UAC_DBGMSG("    CONTROL IFACE:    0x%x\n", (int)uac->acif.iface);
    UAC_DBGMSG("    STREAM IN IFACE:  0x%x\n", (int)uac->asif_in.iface);
    UAC_DBGMSG("    STREAM OUT IFACE: 0x%x\n", (int)uac->asif_out.iface);

    return ret;
}

static void  uac_disconnect(IFACE_T *iface)
{
    UAC_DEV_T    *uac;
    UAC_DEV_T    *p;
    //ALT_IFACE_T  *aif = iface->aif;
    int          i;

    uac = (UAC_DEV_T *)iface->context;

    uac->state = UAC_STATE_DISCONNECTING;

    UAC_DBGMSG("uac_disconnect - device (vid=0x%x, pid=0x%x), interface %d removed.\n",
               uac->udev->descriptor.idVendor, uac->udev->descriptor.idProduct, iface->if_num);

    /*
     *  remove it from UAC device list
     */
    for (i = 0; i < CONFIG_UAC_MAX_DEV; i++)
    {
        if (g_uac_dev[i].udev == iface->udev)
        {
            uac = &g_uac_dev[i];

            if (uac->acif.iface == iface)
            {
                uac->acif.iface = USBNULL;
            }
            else if (uac->asif_in.iface == iface)
            {
                (void)usbh_uac_stop_audio_in(uac);
                uac->asif_in.iface = USBNULL;
            }
            else if (uac->asif_out.iface == iface)
            {
                (void)usbh_uac_stop_audio_out(uac);
                uac->asif_out.iface = USBNULL;
            }
            else
            {
                // Unrecognized interface. This should not happen as the interface should have been checked before.
            }

            if ((uac->acif.iface != USBNULL) || (uac->asif_in.iface != USBNULL) || (uac->asif_out.iface != USBNULL))
            {
                continue;
            }

            /*
             *  All interface of UAC device are all disconnected. Remove it from UAC device list.
             */

            if (uac == g_uac_list)
            {
                g_uac_list = g_uac_list->next;
            }
            else
            {
                for (p = g_uac_list; p != USBNULL; p = p->next)
                {
                    if (p->next == uac)
                    {
                        p->next = uac->next;
                        break;
                    }
                }
            }

            UAC_DBGMSG("uac_disconnect - device (vid=0x%x, pid=0x%x), UAC device removed.\n",
                       uac->udev->descriptor.idVendor, uac->udev->descriptor.idProduct);
            free_uac_device(uac);
        }
    }
}

/// @endcond HIDDEN_SYMBOLS

/**
  * @brief    Initialize USB Audio Class driver.
  * @return   None
  */
void usbh_uac_init(void)
{
    static UDEV_DRV_T  uac_driver =
    {
        uac_probe,
        uac_disconnect,
        USBNULL,                       /* suspend */
        USBNULL,                       /* resume */
    };

    (void)memset((char *)&g_uac_dev[0], 0, sizeof(g_uac_dev));
    g_uac_list = USBNULL;
    (void)usbh_register_driver(&uac_driver);
}

/**
 *  @brief   Get a list of currently connected USB Audio Class devices.
 *  @return  List of current connected UAC devices.
 *  @retval  USBNULL       There's no UAC devices found.
 *  @retval  Otherwise  A list of connected UAC devices.
 *
 *  The Audio Class devices are chained by the "next" member of UAC_DEV_T.
 */
UAC_DEV_T *usbh_uac_get_device_list(void)
{
    return g_uac_list;
}

/** @} end of group USBH_EXPORTED_FUNCTIONS */

/** @} end of group USBH_Library */

/** @} end of group LIBRARY */
